snlkuharlocal/src/Documents/ВГХ/ВГХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВГХ</name>
  <registerRecords>InformationRegister.ВГХ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВКоробочке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаркетПлейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ВидВГХ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеВГХ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ВГХ/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТЗДокумента();
КонецПроцедуры    


&НаСервере
Процедура ЗаполнитьТЗДокумента() 
	
	ТЗВГХ.Очистить();   
	
	Макет=Документы.ВГХ.ПолучитьМакет("МакетВГХ");
	
	Высотка = Макет.ВысотаТаблицы;
	
	для сч=1 по Высотка Цикл      
		
		Если Объект.ШтукВКоробке=0 	и Макет.Область(Сч,6).Текст= "Коробка" Тогда	
			Продолжить;
		КонецЕсли; 
		
		Если Объект.ШтукВКоробочке=0 	и Макет.Область(Сч,6).Текст= "Блочок" Тогда	
			Продолжить;
		КонецЕсли;    
		
		Если Не Объект.МаркетПлейс и Макет.Область(Сч,7).Текст= "МаркетПлейс" Тогда	
			Продолжить;
		КонецЕсли; 		
		
		новстр              = ТЗВГХ.Добавить();
		НовСтр.ВидВГХ       = Макет.Область(Сч,1).Текст;
		НовСтр.Наименование = Макет.Область(Сч,2).Текст;
		
	КонецЦикла;  
	
	
	 


КонецПроцедуры      


&НаКлиенте
Процедура ЗаполнитьТЗДокументаНаКлиенте() 
	
	Для каждого стр из Объект.Данные Цикл   
		
		Если Лев(стр.ВидВГХ,5)="Объем" Тогда
			 Этаформа[стр.ВидВГХ]= Стр.ЗначениеВГХ;
			 Продолжить;
		КОнецЕсли;

		
		Отбор = Новый Структура();
		Отбор.Вставить("ВидВГХ",стр.ВидВГХ);
		Строки = ТЗВГХ.НайтиСтроки(Отбор);
		Если Строки.Количество() > 0 Тогда
			Строки[0].ЗначениеВГХ = Стр.ЗначениеВГХ;
		КонецЕсли;
		
	КонецЦикла;	
КонецПроцедуры      



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	Объект.Данные.Очистить();
	
	Для каждого стр из ТЗВГХ Цикл
		
		Если Стр.ЗначениеВГХ<>0 Тогда
			
			НосТр = Объект.Данные.Добавить();
			ЗаполнитьЗначенияСвойств(НосТр,Стр);
			
		КонецЕсли;
	КонецЦикла;   
	
    ПересчитатьОбъемы();
	 
	
	Если Объект.ШтукВКоробке>0 Тогда
		НосТр = Объект.Данные.Добавить();
		НосТр.ВидВГХ     ="ШтукВКоробке";
		НосТр.ЗначениеВГХ =Объект.ШтукВКоробке; 
		
		НосТр = Объект.Данные.Добавить();
		НосТр.ВидВГХ     ="ОбъемШтукиРасч";
		НосТр.ЗначениеВГХ =ОбъемШтукиРасч;
		
	КонецЕсли;   
	
	
	Если Объект.ШтукВКоробочке>0 Тогда    
		
		НосТр = Объект.Данные.Добавить();
		НосТр.ВидВГХ     ="ШтукВКоробочке";
		НосТр.ЗначениеВГХ =Объект.ШтукВКоробочке;  
		
		НосТр = Объект.Данные.Добавить();
		НосТр.ВидВГХ     ="ОбъемБлочкаРасч";
		НосТр.ЗначениеВГХ =ОбъемБлочкаРасч;
		
	КонецЕсли;    
	
	
	Если ОбъемКоробки>0 Тогда    
		
		НосТр = Объект.Данные.Добавить();
		НосТр.ВидВГХ     ="ОбъемКоробки";
		НосТр.ЗначениеВГХ =ОбъемКоробки;  
		
	КонецЕсли;   
	
	Если ОбъемБлочка>0 Тогда    
		
		НосТр = Объект.Данные.Добавить();
		НосТр.ВидВГХ     ="ОбъемБлочка";
		НосТр.ЗначениеВГХ =ОбъемБлочка;  
		
	КонецЕсли;
	
	
	Если ОбъемШтуки>0 Тогда    
		
		НосТр = Объект.Данные.Добавить();
		НосТр.ВидВГХ     ="ОбъемШтуки";
		НосТр.ЗначениеВГХ =ОбъемШтуки;  
		
	КонецЕсли;      		
	
КонецПроцедуры

&НаКлиенте
Процедура ШтукВКоробкеПриИзменении(Элемент)
	ЗаполнитьТЗДокумента() ;
КонецПроцедуры

&НаКлиенте
Процедура ШтукВКоробочкеПриИзменении(Элемент)
	ЗаполнитьТЗДокумента() ;
КонецПроцедуры

&НаКлиенте
Процедура кнОбновить(Команда)
	кнОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура кнОбновитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры      



///////////////РАСЧЕТЫ ПО ОБЪЕМУ//////////////////////////////////

&НаКлиенте
Процедура ПересчитатьОбъемы()
	
	ОбъемШтуки();	
	ОбъемБлочка();
	ОбъемКоробки(); 
	ОбъемБлочкаРасчетный();
	ОбъемШтукаРасчетный();
КонецПроцедуры



&НаКлиенте
Процедура ОбъемШтуки()
	
	Отбор = Новый Структура();
	Отбор.Вставить("ВидВГХ","ДлинаШтуки"); 
	
	СтрокиП = ТЗВГХ.НайтиСтроки(Отбор);
	Если СтрокиП.Количество() > 0 Тогда
		ДлинаШтуки =СтрокиП[0].ЗначениеВГХ; 
		
		Если ДлинаШтуки >0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("ВидВГХ","ШиринаШтуки"); 
			
			СтрокиП = ТЗВГХ.НайтиСтроки(Отбор);
			Если СтрокиП.Количество() > 0 Тогда
				ШиринаШтуки =СтрокиП[0].ЗначениеВГХ; 
				
				Если ШиринаШтуки >0 Тогда
					
					Отбор = Новый Структура();
					Отбор.Вставить("ВидВГХ","ВысотаШтуки"); 
					
					СтрокиП = ТЗВГХ.НайтиСтроки(Отбор);
					Если СтрокиП.Количество() > 0 Тогда
						ВысотаШтуки =СтрокиП[0].ЗначениеВГХ; 
						
						Если ВысотаШтуки >0 Тогда
							
							ОбъемШтуки =(ШиринаШтуки*ВысотаШтуки*ДлинаШтуки)/1000000;
							
						КонецЕсли;  						
					КонецЕсли;      					
				КонецЕсли;          				
			КонецЕсли;              			
		КонецЕсли;                  		
	КонецЕсли;                      	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбъемБлочка()
	
	Отбор = Новый Структура();
	Отбор.Вставить("ВидВГХ","ДлинаБлочка"); 
	
	СтрокиП = ТЗВГХ.НайтиСтроки(Отбор);
	Если СтрокиП.Количество() > 0 Тогда
		ДлинаБлочка =СтрокиП[0].ЗначениеВГХ; 
		
		Если ДлинаБлочка >0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("ВидВГХ","ШиринаБлочка"); 
			
			СтрокиП = ТЗВГХ.НайтиСтроки(Отбор);
			Если СтрокиП.Количество() > 0 Тогда
				ШиринаБлочка =СтрокиП[0].ЗначениеВГХ; 
				
				Если ШиринаБлочка >0 Тогда
					
					Отбор = Новый Структура();
					Отбор.Вставить("ВидВГХ","ВысотаБлочка"); 
					
					СтрокиП = ТЗВГХ.НайтиСтроки(Отбор);
					Если СтрокиП.Количество() > 0 Тогда
						ВысотаБлочка =СтрокиП[0].ЗначениеВГХ; 
						
						Если ВысотаБлочка >0 Тогда
							
							ОбъемБлочка =(ШиринаБлочка*ВысотаБлочка*ДлинаБлочка)/1000000;
							
						КонецЕсли;  						
					КонецЕсли;      					
				КонецЕсли;          				
			КонецЕсли;              			
		КонецЕсли;                  		
	КонецЕсли;                      	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемКоробки()
	
	Отбор = Новый Структура();
	Отбор.Вставить("ВидВГХ","ДлинаКоробки"); 
	
	СтрокиП = ТЗВГХ.НайтиСтроки(Отбор);
	Если СтрокиП.Количество() > 0 Тогда
		ДлинаКоробки =СтрокиП[0].ЗначениеВГХ; 
		
		Если ДлинаКоробки >0 Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("ВидВГХ","ШиринаКоробки"); 
			
			СтрокиП = ТЗВГХ.НайтиСтроки(Отбор);
			Если СтрокиП.Количество() > 0 Тогда
				ШиринаКоробки =СтрокиП[0].ЗначениеВГХ; 
				
				Если ШиринаКоробки >0 Тогда
					
					Отбор = Новый Структура();
					Отбор.Вставить("ВидВГХ","ВысотаКоробки"); 
					
					СтрокиП = ТЗВГХ.НайтиСтроки(Отбор);
					Если СтрокиП.Количество() > 0 Тогда
						ВысотаКоробки =СтрокиП[0].ЗначениеВГХ; 
						
						Если ВысотаКоробки >0 Тогда
							
							ОбъемКоробки =(ШиринаКоробки*ВысотаКоробки*ДлинаКоробки)/1000000;
							
						КонецЕсли;  						
					КонецЕсли;      					
				КонецЕсли;          				
			КонецЕсли;              			
		КонецЕсли;                  		
	КонецЕсли;                      	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбъемБлочкаРасчетный()
	
	Если Объект.ШтукВКоробочке>0 Тогда
	     ОбъемБлочкаРасч = ОбъемКоробки/Объект.ШтукВКоробочке;	
	КонецЕсли;
	
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбъемШтукаРасчетный()
	
	Если Объект.ШтукВКоробке>0 Тогда
	     ОбъемШтукиРасч = ОбъемКоробки/Объект.ШтукВКоробке;	
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Группа5ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Модифицированность и Элемент.ТекущаяСтраница.Заголовок="Объем" тогда
		ПересчитатьОбъемы(); 	
	КонецЕсли
	
	
КонецПроцедуры

&НаКлиенте
Процедура кнПересчет(Команда)
	ПересчитатьОбъемы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТЗДокументаНаКлиенте();
КонецПроцедуры
